///СПИСКИ РАСХОДОВ
var purpose = [
  [
    'собственные средства',
    'закупка стройматериалов',
    'возврат инвестиций',
    'покупка земельного участка',
    'услуги мастера',
    'реклама',
    'другое',
  ],
  [
    false,
    false,
    false,
    false,
    false,
    false,
    false,
  ]
];

var positionConsumption = [
  [
    'Не указывать',
    'кровля',
    'кирпич',
    'метал',
    'шпкалевка',
    'бетон',
    'сантехническое оборудование',
  ],
  [
    false,
    false,
    false,
    false,
    false,
    false,
    false,
  ]
];

var listFilter = [
  [
    ['Бизнесы', 0],
    ['Источники прихода', 1],
    ['Цели расхода', 2],
    ['Позиции', 3],
    ['Пользователи', 4],
  ],
];

var myScrollList = [];

var istochnic;

var listReport = [

    ['Баланс за период', 0],
    ['Бизнесы', 1],
    ['Источники прихода', 2],
    ['Цели расхода', 3],
    ['Позиция', 4],
    ['Пользователь', 5],

];

List listIstochPrihod = [];
List listIstochPrihodDel = [];

List listFilterBuiss = [];

var listRow = [
  "Источники",
  "Бизнесы",
];

var listRowPosition = [
  "Позиция",
  "Источники",
  "Цель",
  "Бизнесы",
];

var listCelRas = [
  "Цель расхода",
  "Бизнесы",
];
///test========================================================================
var listData = [21,22,23,24,25,26,27,28,29];
var listMany = [100000, 270000,-200,100000,320000,-500000,500000,200000,400];
///============================================================================